Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxEray_reg.h
/** \brief 168, Even Sync ID Symbol Window ${nn} */
#define ERAY0_ESID_1S14 /*lint --e(923)*/ (*(volatile Ifx_ERAY_ESID_1S*)0xF001C168u)
/** Alias (User Manual Name) for ERAY0_ESID_1S14.
* To use register names with standard convension, please use ERAY0_ESID_1S14.
*/
#define ERAY0_ESID14 (ERAY0_ESID_1S14)

/** \brief 170, Odd Sync ID Symbol Window ${nn} */
#define ERAY0_OSID_1S0 /*lint --e(923)*/ (*(volatile Ifx_ERAY_OSID_1S*)0xF001C170u)
/** Alias (User Manual Name) for ERAY0_OSID_1S0.
* To use register names with standard convension, please use ERAY0_OSID_1S0.
*/
#define ERAY0_OSID0 (ERAY0_OSID_1S0)

/** \brief 174, Odd Sync ID Symbol Window ${nn} */
#define ERAY0_OSID_1S1 /*lint --e(923)*/ (*(volatile Ifx_ERAY_OSID_1S*)0xF001C174u)
/** Alias (User Manual Name) for ERAY0_OSID_1S1.
* To use register names with standard convension, please use ERAY0_OSID_1S1.
*/
#define ERAY0_OSID1 (ERAY0_OSID_1S1)

/** \brief 178, Odd Sync ID Symbol Window ${nn} */
#define ERAY0_OSID_1S2 /*lint --e(923)*/ (*(volatile Ifx_ERAY_OSID_1S*)0xF001C178u)
/** Alias (User Manual Name) for ERAY0_OSID_1S2.
* To use register names with standard convension, please use ERAY0_OSID_1S2.
*/
#define ERAY0_OSID2 (ERAY0_OSID_1S2)

/** \brief 17C, Odd Sync ID Symbol Window ${nn} */
#define ERAY0_OSID_1S3 /*lint --e(923)*/ (*(volatile Ifx_ERAY_OSID_1S*)0xF001C17Cu)
/** Alias (User Manual Name) for ERAY0_OSID_1S3.
* To use register names with standard convension, please use ERAY0_OSID_1S3.
*/
#define ERAY0_OSID3 (ERAY0_OSID_1S3)

/** \brief 180, Odd Sync ID Symbol Window ${nn} */
#define ERAY0_OSID_1S4 /*lint --e(923)*/ (*(volatile Ifx_ERAY_OSID_1S*)0xF001C180u)
/** Alias (User Manual Name) for ERAY0_OSID_1S4.
* To use register names with standard convension, please use ERAY0_OSID_1S4.
*/
#define ERAY0_OSID4 (ERAY0_OSID_1S4)

/** \brief 184, Odd Sync ID Symbol Window ${nn} */
#define ERAY0_OSID_1S5 /*lint --e(923)*/ (*(volatile Ifx_ERAY_OSID_1S*)0xF001C184u)
/** Alias (User Manual Name) for ERAY0_OSID_1S5.
* To use register names with standard convension, please use ERAY0_OSID_1S5.
*/
#define ERAY0_OSID5 (ERAY0_OSID_1S5)

/** \brief 188, Odd Sync ID Symbol Window ${nn} */
#define ERAY0_OSID_1S6 /*lint --e(923)*/ (*(volatile Ifx_ERAY_OSID_1S*)0xF001C188u)
/** Alias (User Manual Name) for ERAY0_OSID_1S6.
* To use register names with standard convension, please use ERAY0_OSID_1S6.
*/
#define ERAY0_OSID6 (ERAY0_OSID_1S6)

/** \brief 18C, Odd Sync ID Symbol Window ${nn} */
#define ERAY0_OSID_1S7 /*lint --e(923)*/ (*(volatile Ifx_ERAY_OSID_1S*)0xF001C18Cu)
/** Alias (User Manual Name) for ERAY0_OSID_1S7.
* To use register names with standard convension, please use ERAY0_OSID_1S7.
*/
#define ERAY0_OSID7 (ERAY0_OSID_1S7)

/** \brief 190, Odd Sync ID Symbol Window ${nn} */
#define ERAY0_OSID_1S8 /*lint --e(923)*/ (*(volatile Ifx_ERAY_OSID_1S*)0xF001C190u)
/** Alias (User Manual Name) for ERAY0_OSID_1S8.
* To use register names with standard convension, please use ERAY0_OSID_1S8.
*/
#define ERAY0_OSID8 (ERAY0_OSID_1S8)

/** \brief 194, Odd Sync ID Symbol Window ${nn} */
#define ERAY0_OSID_1S9 /*lint --e(923)*/ (*(volatile Ifx_ERAY_OSID_1S*)0xF001C194u)
/** Alias (User Manual Name) for ERAY0_OSID_1S9.
* To use register names with standard convension, please use ERAY0_OSID_1S9.
*/
#define ERAY0_OSID9 (ERAY0_OSID_1S9)

/** \brief 198, Odd Sync ID Symbol Window ${nn} */
#define ERAY0_OSID_1S10 /*lint --e(923)*/ (*(volatile Ifx_ERAY_OSID_1S*)0xF001C198u)
/** Alias (User Manual Name) for ERAY0_OSID_1S10.
* To use register names with standard convension, please use ERAY0_OSID_1S10.
*/
#define ERAY0_OSID10 (ERAY0_OSID_1S10)

/** \brief 19C, Odd Sync ID Symbol Window ${nn} */
#define ERAY0_OSID_1S11 /*lint --e(923)*/ (*(volatile Ifx_ERAY_OSID_1S*)0xF001C19Cu)
/** Alias (User Manual Name) for ERAY0_OSID_1S11.
* To use register names with standard convension, please use ERAY0_OSID_1S11.
*/
#define ERAY0_OSID11 (ERAY0_OSID_1S11)

/** \brief 1A0, Odd Sync ID Symbol Window ${nn} */
#define ERAY0_OSID_1S12 /*lint --e(923)*/ (*(volatile Ifx_ERAY_OSID_1S*)0xF001C1A0u)
/** Alias (User Manual Name) for ERAY0_OSID_1S12.
* To use register names with standard convension, please use ERAY0_OSID_1S12.
*/
#define ERAY0_OSID12 (ERAY0_OSID_1S12)

/** \brief 1A4, Odd Sync ID Symbol Window ${nn} */
#define ERAY0_OSID_1S13 /*lint --e(923)*/ (*(volatile Ifx_ERAY_OSID_1S*)0xF001C1A4u)
/** Alias (User Manual Name) for ERAY0_OSID_1S13.
* To use register names with standard convension, please use ERAY0_OSID_1S13.
*/
#define ERAY0_OSID13 (ERAY0_OSID_1S13)

/** \brief 1A8, Odd Sync ID Symbol Window ${nn} */
#define ERAY0_OSID_1S14 /*lint --e(923)*/ (*(volatile Ifx_ERAY_OSID_1S*)0xF001C1A8u)
/** Alias (User Manual Name) for ERAY0_OSID_1S14.
* To use register names with standard convension, please use ERAY0_OSID_1S14.
*/
#define ERAY0_OSID14 (ERAY0_OSID_1S14)

/** \brief 1B0, Network Management Vector ${x} */
#define ERAY0_NMV_1S0 /*lint --e(923)*/ (*(volatile Ifx_ERAY_NMV_1S*)0xF001C1B0u)
/** Alias (User Manual Name) for ERAY0_NMV_1S0.
* To use register names with standard convension, please use ERAY0_NMV_1S0.
*/
#define ERAY0_NMV0 (ERAY0_NMV_1S0)

/** \brief 1B4, Network Management Vector ${x} */
#define ERAY0_NMV_1S1 /*lint --e(923)*/ (*(volatile Ifx_ERAY_NMV_1S*)0xF001C1B4u)
/** Alias (User Manual Name) for ERAY0_NMV_1S1.
* To use register names with standard convension, please use ERAY0_NMV_1S1.
*/
#define ERAY0_NMV1 (ERAY0_NMV_1S1)

/** \brief 1B8, Network Management Vector ${x} */
#define ERAY0_NMV_1S2 /*lint --e(923)*/ (*(volatile Ifx_ERAY_NMV_1S*)0xF001C1B8u)
/** Alias (User Manual Name) for ERAY0_NMV_1S2.
* To use register names with standard convension, please use ERAY0_NMV_1S2.
*/
#define ERAY0_NMV2 (ERAY0_NMV_1S2)

/** \brief 300, Message RAM Configuration */
#define ERAY0_MRC /*lint --e(923)*/ (*(volatile Ifx_ERAY_MRC*)0xF001C300u)

/** \brief 304, FIFO Rejection Filter */
#define ERAY0_FRF /*lint --e(923)*/ (*(volatile Ifx_ERAY_FRF*)0xF001C304u)

/** \brief 308, FIFO Rejection Filter Mask */
#define ERAY0_FRFM /*lint --e(923)*/ (*(volatile Ifx_ERAY_FRFM*)0xF001C308u)

/** \brief 30C, FIFO Critical Level */
#define ERAY0_FCL /*lint --e(923)*/ (*(volatile Ifx_ERAY_FCL*)0xF001C30Cu)

/** \brief 310, Message Handler Status */
#define ERAY0_MHDS /*lint --e(923)*/ (*(volatile Ifx_ERAY_MHDS*)0xF001C310u)

/** \brief 314, Last Dynamic Transmit Slot */
#define ERAY0_LDTS /*lint --e(923)*/ (*(volatile Ifx_ERAY_LDTS*)0xF001C314u)

/** \brief 318, FIFO Status Register */
#define ERAY0_FSR /*lint --e(923)*/ (*(volatile Ifx_ERAY_FSR*)0xF001C318u)

/** \brief 31C, Message Handler Constraints Flags */
#define ERAY0_MHDF /*lint --e(923)*/ (*(volatile Ifx_ERAY_MHDF*)0xF001C31Cu)

/** \brief 320, Transmission Request Register 1 */
#define ERAY0_TXRQ1 /*lint --e(923)*/ (*(volatile Ifx_ERAY_TXRQ1*)0xF001C320u)

/** \brief 324, Transmission Request Register 2 */
#define ERAY0_TXRQ2 /*lint --e(923)*/ (*(volatile Ifx_ERAY_TXRQ2*)0xF001C324u)

/** \brief 328, Transmission Request Register 3 */
#define ERAY0_TXRQ3 /*lint --e(923)*/ (*(volatile Ifx_ERAY_TXRQ3*)0xF001C328u)

/** \brief 32C, Transmission Request Register 4 */
#define ERAY0_TXRQ4 /*lint --e(923)*/ (*(volatile Ifx_ERAY_TXRQ4*)0xF001C32Cu)

/** \brief 330, New Data Register 1 */
#define ERAY0_NDAT1 /*lint --e(923)*/ (*(volatile Ifx_ERAY_NDAT1*)0xF001C330u)

/** \brief 334, New Data Register 2 */
#define ERAY0_NDAT2 /*lint --e(923)*/ (*(volatile Ifx_ERAY_NDAT2*)0xF001C334u)

/** \brief 338, New Data Register 3 */
#define ERAY0_NDAT3 /*lint --e(923)*/ (*(volatile Ifx_ERAY_NDAT3*)0xF001C338u)

