Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxEray_reg.h
/** \brief 33C, New Data Register 4 */
#define ERAY0_NDAT4 /*lint --e(923)*/ (*(volatile Ifx_ERAY_NDAT4*)0xF001C33Cu)

/** \brief 340, Message Buffer Status Changed 1 */
#define ERAY0_MBSC1 /*lint --e(923)*/ (*(volatile Ifx_ERAY_MBSC1*)0xF001C340u)

/** \brief 344, Message Buffer Status Changed 2 */
#define ERAY0_MBSC2 /*lint --e(923)*/ (*(volatile Ifx_ERAY_MBSC2*)0xF001C344u)

/** \brief 348, Message Buffer Status Changed 3 */
#define ERAY0_MBSC3 /*lint --e(923)*/ (*(volatile Ifx_ERAY_MBSC3*)0xF001C348u)

/** \brief 34C, Message Buffer Status Changed 4 */
#define ERAY0_MBSC4 /*lint --e(923)*/ (*(volatile Ifx_ERAY_MBSC4*)0xF001C34Cu)

/** \brief 3A8, New Data Interrupt Control 1 */
#define ERAY0_NDIC1 /*lint --e(923)*/ (*(volatile Ifx_ERAY_NDIC1*)0xF001C3A8u)

/** \brief 3AC, New Data Interrupt Control 2 */
#define ERAY0_NDIC2 /*lint --e(923)*/ (*(volatile Ifx_ERAY_NDIC2*)0xF001C3ACu)

/** \brief 3B0, New Data Interrupt Control 3 */
#define ERAY0_NDIC3 /*lint --e(923)*/ (*(volatile Ifx_ERAY_NDIC3*)0xF001C3B0u)

/** \brief 3B4, New Data Interrupt Control 4 */
#define ERAY0_NDIC4 /*lint --e(923)*/ (*(volatile Ifx_ERAY_NDIC4*)0xF001C3B4u)

/** \brief 3B8, Message Buffer Status Changed Interrupt Control 1 */
#define ERAY0_MSIC1 /*lint --e(923)*/ (*(volatile Ifx_ERAY_MSIC1*)0xF001C3B8u)

/** \brief 3BC, Message Buffer Status Changed Interrupt Control 2 */
#define ERAY0_MSIC2 /*lint --e(923)*/ (*(volatile Ifx_ERAY_MSIC2*)0xF001C3BCu)

/** \brief 3C0, Message Buffer Status Changed Interrupt Control 3 */
#define ERAY0_MSIC3 /*lint --e(923)*/ (*(volatile Ifx_ERAY_MSIC3*)0xF001C3C0u)

/** \brief 3C4, Message Buffer Status Changed Interrupt Control 4 */
#define ERAY0_MSIC4 /*lint --e(923)*/ (*(volatile Ifx_ERAY_MSIC4*)0xF001C3C4u)

/** \brief 3F0, Core Release Register */
#define ERAY0_CREL /*lint --e(923)*/ (*(volatile Ifx_ERAY_CREL*)0xF001C3F0u)

/** \brief 3F4, Endian Register */
#define ERAY0_ENDN /*lint --e(923)*/ (*(volatile Ifx_ERAY_ENDN*)0xF001C3F4u)

/** \brief 400, Write Data Section ${nn} */
#define ERAY0_WRDS_1S0 /*lint --e(923)*/ (*(volatile Ifx_ERAY_WRDS_1S*)0xF001C400u)
/** Alias (User Manual Name) for ERAY0_WRDS_1S0.
* To use register names with standard convension, please use ERAY0_WRDS_1S0.
*/
#define ERAY0_WRDS0 (ERAY0_WRDS_1S0)

/** \brief 404, Write Data Section ${nn} */
#define ERAY0_WRDS_1S1 /*lint --e(923)*/ (*(volatile Ifx_ERAY_WRDS_1S*)0xF001C404u)
/** Alias (User Manual Name) for ERAY0_WRDS_1S1.
* To use register names with standard convension, please use ERAY0_WRDS_1S1.
*/
#define ERAY0_WRDS1 (ERAY0_WRDS_1S1)

/** \brief 408, Write Data Section ${nn} */
#define ERAY0_WRDS_1S2 /*lint --e(923)*/ (*(volatile Ifx_ERAY_WRDS_1S*)0xF001C408u)
/** Alias (User Manual Name) for ERAY0_WRDS_1S2.
* To use register names with standard convension, please use ERAY0_WRDS_1S2.
*/
#define ERAY0_WRDS2 (ERAY0_WRDS_1S2)

/** \brief 40C, Write Data Section ${nn} */
#define ERAY0_WRDS_1S3 /*lint --e(923)*/ (*(volatile Ifx_ERAY_WRDS_1S*)0xF001C40Cu)
/** Alias (User Manual Name) for ERAY0_WRDS_1S3.
* To use register names with standard convension, please use ERAY0_WRDS_1S3.
*/
#define ERAY0_WRDS3 (ERAY0_WRDS_1S3)

/** \brief 410, Write Data Section ${nn} */
#define ERAY0_WRDS_1S4 /*lint --e(923)*/ (*(volatile Ifx_ERAY_WRDS_1S*)0xF001C410u)
/** Alias (User Manual Name) for ERAY0_WRDS_1S4.
* To use register names with standard convension, please use ERAY0_WRDS_1S4.
*/
#define ERAY0_WRDS4 (ERAY0_WRDS_1S4)

/** \brief 414, Write Data Section ${nn} */
#define ERAY0_WRDS_1S5 /*lint --e(923)*/ (*(volatile Ifx_ERAY_WRDS_1S*)0xF001C414u)
/** Alias (User Manual Name) for ERAY0_WRDS_1S5.
* To use register names with standard convension, please use ERAY0_WRDS_1S5.
*/
#define ERAY0_WRDS5 (ERAY0_WRDS_1S5)

/** \brief 418, Write Data Section ${nn} */
#define ERAY0_WRDS_1S6 /*lint --e(923)*/ (*(volatile Ifx_ERAY_WRDS_1S*)0xF001C418u)
/** Alias (User Manual Name) for ERAY0_WRDS_1S6.
* To use register names with standard convension, please use ERAY0_WRDS_1S6.
*/
#define ERAY0_WRDS6 (ERAY0_WRDS_1S6)

/** \brief 41C, Write Data Section ${nn} */
#define ERAY0_WRDS_1S7 /*lint --e(923)*/ (*(volatile Ifx_ERAY_WRDS_1S*)0xF001C41Cu)
/** Alias (User Manual Name) for ERAY0_WRDS_1S7.
* To use register names with standard convension, please use ERAY0_WRDS_1S7.
*/
#define ERAY0_WRDS7 (ERAY0_WRDS_1S7)

/** \brief 420, Write Data Section ${nn} */
#define ERAY0_WRDS_1S8 /*lint --e(923)*/ (*(volatile Ifx_ERAY_WRDS_1S*)0xF001C420u)
/** Alias (User Manual Name) for ERAY0_WRDS_1S8.
* To use register names with standard convension, please use ERAY0_WRDS_1S8.
*/
#define ERAY0_WRDS8 (ERAY0_WRDS_1S8)

/** \brief 424, Write Data Section ${nn} */
#define ERAY0_WRDS_1S9 /*lint --e(923)*/ (*(volatile Ifx_ERAY_WRDS_1S*)0xF001C424u)
/** Alias (User Manual Name) for ERAY0_WRDS_1S9.
* To use register names with standard convension, please use ERAY0_WRDS_1S9.
*/
#define ERAY0_WRDS9 (ERAY0_WRDS_1S9)

/** \brief 428, Write Data Section ${nn} */
#define ERAY0_WRDS_1S10 /*lint --e(923)*/ (*(volatile Ifx_ERAY_WRDS_1S*)0xF001C428u)
/** Alias (User Manual Name) for ERAY0_WRDS_1S10.
* To use register names with standard convension, please use ERAY0_WRDS_1S10.
*/
#define ERAY0_WRDS10 (ERAY0_WRDS_1S10)

/** \brief 42C, Write Data Section ${nn} */
#define ERAY0_WRDS_1S11 /*lint --e(923)*/ (*(volatile Ifx_ERAY_WRDS_1S*)0xF001C42Cu)
/** Alias (User Manual Name) for ERAY0_WRDS_1S11.
* To use register names with standard convension, please use ERAY0_WRDS_1S11.
*/
#define ERAY0_WRDS11 (ERAY0_WRDS_1S11)

/** \brief 430, Write Data Section ${nn} */
#define ERAY0_WRDS_1S12 /*lint --e(923)*/ (*(volatile Ifx_ERAY_WRDS_1S*)0xF001C430u)
/** Alias (User Manual Name) for ERAY0_WRDS_1S12.
* To use register names with standard convension, please use ERAY0_WRDS_1S12.
*/
#define ERAY0_WRDS12 (ERAY0_WRDS_1S12)

/** \brief 434, Write Data Section ${nn} */
#define ERAY0_WRDS_1S13 /*lint --e(923)*/ (*(volatile Ifx_ERAY_WRDS_1S*)0xF001C434u)
/** Alias (User Manual Name) for ERAY0_WRDS_1S13.
* To use register names with standard convension, please use ERAY0_WRDS_1S13.
*/
#define ERAY0_WRDS13 (ERAY0_WRDS_1S13)

/** \brief 438, Write Data Section ${nn} */
#define ERAY0_WRDS_1S14 /*lint --e(923)*/ (*(volatile Ifx_ERAY_WRDS_1S*)0xF001C438u)
/** Alias (User Manual Name) for ERAY0_WRDS_1S14.
* To use register names with standard convension, please use ERAY0_WRDS_1S14.
*/
#define ERAY0_WRDS14 (ERAY0_WRDS_1S14)

/** \brief 43C, Write Data Section ${nn} */
#define ERAY0_WRDS_1S15 /*lint --e(923)*/ (*(volatile Ifx_ERAY_WRDS_1S*)0xF001C43Cu)
/** Alias (User Manual Name) for ERAY0_WRDS_1S15.
* To use register names with standard convension, please use ERAY0_WRDS_1S15.
*/
#define ERAY0_WRDS15 (ERAY0_WRDS_1S15)

/** \brief 440, Write Data Section ${nn} */
#define ERAY0_WRDS_1S16 /*lint --e(923)*/ (*(volatile Ifx_ERAY_WRDS_1S*)0xF001C440u)
/** Alias (User Manual Name) for ERAY0_WRDS_1S16.
* To use register names with standard convension, please use ERAY0_WRDS_1S16.
*/
#define ERAY0_WRDS16 (ERAY0_WRDS_1S16)

/** \brief 444, Write Data Section ${nn} */
#define ERAY0_WRDS_1S17 /*lint --e(923)*/ (*(volatile Ifx_ERAY_WRDS_1S*)0xF001C444u)
/** Alias (User Manual Name) for ERAY0_WRDS_1S17.
* To use register names with standard convension, please use ERAY0_WRDS_1S17.
*/
#define ERAY0_WRDS17 (ERAY0_WRDS_1S17)

