Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxEray_reg.h
/** \brief 4AC, Write Data Section ${nn} */
#define ERAY0_WRDS_1S43 /*lint --e(923)*/ (*(volatile Ifx_ERAY_WRDS_1S*)0xF001C4ACu)
/** Alias (User Manual Name) for ERAY0_WRDS_1S43.
* To use register names with standard convension, please use ERAY0_WRDS_1S43.
*/
#define ERAY0_WRDS43 (ERAY0_WRDS_1S43)

/** \brief 4B0, Write Data Section ${nn} */
#define ERAY0_WRDS_1S44 /*lint --e(923)*/ (*(volatile Ifx_ERAY_WRDS_1S*)0xF001C4B0u)
/** Alias (User Manual Name) for ERAY0_WRDS_1S44.
* To use register names with standard convension, please use ERAY0_WRDS_1S44.
*/
#define ERAY0_WRDS44 (ERAY0_WRDS_1S44)

/** \brief 4B4, Write Data Section ${nn} */
#define ERAY0_WRDS_1S45 /*lint --e(923)*/ (*(volatile Ifx_ERAY_WRDS_1S*)0xF001C4B4u)
/** Alias (User Manual Name) for ERAY0_WRDS_1S45.
* To use register names with standard convension, please use ERAY0_WRDS_1S45.
*/
#define ERAY0_WRDS45 (ERAY0_WRDS_1S45)

/** \brief 4B8, Write Data Section ${nn} */
#define ERAY0_WRDS_1S46 /*lint --e(923)*/ (*(volatile Ifx_ERAY_WRDS_1S*)0xF001C4B8u)
/** Alias (User Manual Name) for ERAY0_WRDS_1S46.
* To use register names with standard convension, please use ERAY0_WRDS_1S46.
*/
#define ERAY0_WRDS46 (ERAY0_WRDS_1S46)

/** \brief 4BC, Write Data Section ${nn} */
#define ERAY0_WRDS_1S47 /*lint --e(923)*/ (*(volatile Ifx_ERAY_WRDS_1S*)0xF001C4BCu)
/** Alias (User Manual Name) for ERAY0_WRDS_1S47.
* To use register names with standard convension, please use ERAY0_WRDS_1S47.
*/
#define ERAY0_WRDS47 (ERAY0_WRDS_1S47)

/** \brief 4C0, Write Data Section ${nn} */
#define ERAY0_WRDS_1S48 /*lint --e(923)*/ (*(volatile Ifx_ERAY_WRDS_1S*)0xF001C4C0u)
/** Alias (User Manual Name) for ERAY0_WRDS_1S48.
* To use register names with standard convension, please use ERAY0_WRDS_1S48.
*/
#define ERAY0_WRDS48 (ERAY0_WRDS_1S48)

/** \brief 4C4, Write Data Section ${nn} */
#define ERAY0_WRDS_1S49 /*lint --e(923)*/ (*(volatile Ifx_ERAY_WRDS_1S*)0xF001C4C4u)
/** Alias (User Manual Name) for ERAY0_WRDS_1S49.
* To use register names with standard convension, please use ERAY0_WRDS_1S49.
*/
#define ERAY0_WRDS49 (ERAY0_WRDS_1S49)

/** \brief 4C8, Write Data Section ${nn} */
#define ERAY0_WRDS_1S50 /*lint --e(923)*/ (*(volatile Ifx_ERAY_WRDS_1S*)0xF001C4C8u)
/** Alias (User Manual Name) for ERAY0_WRDS_1S50.
* To use register names with standard convension, please use ERAY0_WRDS_1S50.
*/
#define ERAY0_WRDS50 (ERAY0_WRDS_1S50)

/** \brief 4CC, Write Data Section ${nn} */
#define ERAY0_WRDS_1S51 /*lint --e(923)*/ (*(volatile Ifx_ERAY_WRDS_1S*)0xF001C4CCu)
/** Alias (User Manual Name) for ERAY0_WRDS_1S51.
* To use register names with standard convension, please use ERAY0_WRDS_1S51.
*/
#define ERAY0_WRDS51 (ERAY0_WRDS_1S51)

/** \brief 4D0, Write Data Section ${nn} */
#define ERAY0_WRDS_1S52 /*lint --e(923)*/ (*(volatile Ifx_ERAY_WRDS_1S*)0xF001C4D0u)
/** Alias (User Manual Name) for ERAY0_WRDS_1S52.
* To use register names with standard convension, please use ERAY0_WRDS_1S52.
*/
#define ERAY0_WRDS52 (ERAY0_WRDS_1S52)

/** \brief 4D4, Write Data Section ${nn} */
#define ERAY0_WRDS_1S53 /*lint --e(923)*/ (*(volatile Ifx_ERAY_WRDS_1S*)0xF001C4D4u)
/** Alias (User Manual Name) for ERAY0_WRDS_1S53.
* To use register names with standard convension, please use ERAY0_WRDS_1S53.
*/
#define ERAY0_WRDS53 (ERAY0_WRDS_1S53)

/** \brief 4D8, Write Data Section ${nn} */
#define ERAY0_WRDS_1S54 /*lint --e(923)*/ (*(volatile Ifx_ERAY_WRDS_1S*)0xF001C4D8u)
/** Alias (User Manual Name) for ERAY0_WRDS_1S54.
* To use register names with standard convension, please use ERAY0_WRDS_1S54.
*/
#define ERAY0_WRDS54 (ERAY0_WRDS_1S54)

/** \brief 4DC, Write Data Section ${nn} */
#define ERAY0_WRDS_1S55 /*lint --e(923)*/ (*(volatile Ifx_ERAY_WRDS_1S*)0xF001C4DCu)
/** Alias (User Manual Name) for ERAY0_WRDS_1S55.
* To use register names with standard convension, please use ERAY0_WRDS_1S55.
*/
#define ERAY0_WRDS55 (ERAY0_WRDS_1S55)

/** \brief 4E0, Write Data Section ${nn} */
#define ERAY0_WRDS_1S56 /*lint --e(923)*/ (*(volatile Ifx_ERAY_WRDS_1S*)0xF001C4E0u)
/** Alias (User Manual Name) for ERAY0_WRDS_1S56.
* To use register names with standard convension, please use ERAY0_WRDS_1S56.
*/
#define ERAY0_WRDS56 (ERAY0_WRDS_1S56)

/** \brief 4E4, Write Data Section ${nn} */
#define ERAY0_WRDS_1S57 /*lint --e(923)*/ (*(volatile Ifx_ERAY_WRDS_1S*)0xF001C4E4u)
/** Alias (User Manual Name) for ERAY0_WRDS_1S57.
* To use register names with standard convension, please use ERAY0_WRDS_1S57.
*/
#define ERAY0_WRDS57 (ERAY0_WRDS_1S57)

/** \brief 4E8, Write Data Section ${nn} */
#define ERAY0_WRDS_1S58 /*lint --e(923)*/ (*(volatile Ifx_ERAY_WRDS_1S*)0xF001C4E8u)
/** Alias (User Manual Name) for ERAY0_WRDS_1S58.
* To use register names with standard convension, please use ERAY0_WRDS_1S58.
*/
#define ERAY0_WRDS58 (ERAY0_WRDS_1S58)

/** \brief 4EC, Write Data Section ${nn} */
#define ERAY0_WRDS_1S59 /*lint --e(923)*/ (*(volatile Ifx_ERAY_WRDS_1S*)0xF001C4ECu)
/** Alias (User Manual Name) for ERAY0_WRDS_1S59.
* To use register names with standard convension, please use ERAY0_WRDS_1S59.
*/
#define ERAY0_WRDS59 (ERAY0_WRDS_1S59)

/** \brief 4F0, Write Data Section ${nn} */
#define ERAY0_WRDS_1S60 /*lint --e(923)*/ (*(volatile Ifx_ERAY_WRDS_1S*)0xF001C4F0u)
/** Alias (User Manual Name) for ERAY0_WRDS_1S60.
* To use register names with standard convension, please use ERAY0_WRDS_1S60.
*/
#define ERAY0_WRDS60 (ERAY0_WRDS_1S60)

/** \brief 4F4, Write Data Section ${nn} */
#define ERAY0_WRDS_1S61 /*lint --e(923)*/ (*(volatile Ifx_ERAY_WRDS_1S*)0xF001C4F4u)
/** Alias (User Manual Name) for ERAY0_WRDS_1S61.
* To use register names with standard convension, please use ERAY0_WRDS_1S61.
*/
#define ERAY0_WRDS61 (ERAY0_WRDS_1S61)

/** \brief 4F8, Write Data Section ${nn} */
#define ERAY0_WRDS_1S62 /*lint --e(923)*/ (*(volatile Ifx_ERAY_WRDS_1S*)0xF001C4F8u)
/** Alias (User Manual Name) for ERAY0_WRDS_1S62.
* To use register names with standard convension, please use ERAY0_WRDS_1S62.
*/
#define ERAY0_WRDS62 (ERAY0_WRDS_1S62)

/** \brief 4FC, Write Data Section ${nn} */
#define ERAY0_WRDS_1S63 /*lint --e(923)*/ (*(volatile Ifx_ERAY_WRDS_1S*)0xF001C4FCu)
/** Alias (User Manual Name) for ERAY0_WRDS_1S63.
* To use register names with standard convension, please use ERAY0_WRDS_1S63.
*/
#define ERAY0_WRDS63 (ERAY0_WRDS_1S63)

/** \brief 500, Write Header Section 1 */
#define ERAY0_WRHS1 /*lint --e(923)*/ (*(volatile Ifx_ERAY_WRHS1*)0xF001C500u)

/** \brief 504, Write Header Section 2 */
#define ERAY0_WRHS2 /*lint --e(923)*/ (*(volatile Ifx_ERAY_WRHS2*)0xF001C504u)

