Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxEray_reg.h
/** \brief 508, Write Header Section 3 */
#define ERAY0_WRHS3 /*lint --e(923)*/ (*(volatile Ifx_ERAY_WRHS3*)0xF001C508u)

/** \brief 510, Input Buffer Command Mask */
#define ERAY0_IBCM /*lint --e(923)*/ (*(volatile Ifx_ERAY_IBCM*)0xF001C510u)

/** \brief 514, Input Buffer Command Request */
#define ERAY0_IBCR /*lint --e(923)*/ (*(volatile Ifx_ERAY_IBCR*)0xF001C514u)

/** \brief 600, Read Data Section ${nn} */
#define ERAY0_RDDS_1S0 /*lint --e(923)*/ (*(volatile Ifx_ERAY_RDDS_1S*)0xF001C600u)
/** Alias (User Manual Name) for ERAY0_RDDS_1S0.
* To use register names with standard convension, please use ERAY0_RDDS_1S0.
*/
#define ERAY0_RDDS0 (ERAY0_RDDS_1S0)

/** \brief 604, Read Data Section ${nn} */
#define ERAY0_RDDS_1S1 /*lint --e(923)*/ (*(volatile Ifx_ERAY_RDDS_1S*)0xF001C604u)
/** Alias (User Manual Name) for ERAY0_RDDS_1S1.
* To use register names with standard convension, please use ERAY0_RDDS_1S1.
*/
#define ERAY0_RDDS1 (ERAY0_RDDS_1S1)

/** \brief 608, Read Data Section ${nn} */
#define ERAY0_RDDS_1S2 /*lint --e(923)*/ (*(volatile Ifx_ERAY_RDDS_1S*)0xF001C608u)
/** Alias (User Manual Name) for ERAY0_RDDS_1S2.
* To use register names with standard convension, please use ERAY0_RDDS_1S2.
*/
#define ERAY0_RDDS2 (ERAY0_RDDS_1S2)

/** \brief 60C, Read Data Section ${nn} */
#define ERAY0_RDDS_1S3 /*lint --e(923)*/ (*(volatile Ifx_ERAY_RDDS_1S*)0xF001C60Cu)
/** Alias (User Manual Name) for ERAY0_RDDS_1S3.
* To use register names with standard convension, please use ERAY0_RDDS_1S3.
*/
#define ERAY0_RDDS3 (ERAY0_RDDS_1S3)

/** \brief 610, Read Data Section ${nn} */
#define ERAY0_RDDS_1S4 /*lint --e(923)*/ (*(volatile Ifx_ERAY_RDDS_1S*)0xF001C610u)
/** Alias (User Manual Name) for ERAY0_RDDS_1S4.
* To use register names with standard convension, please use ERAY0_RDDS_1S4.
*/
#define ERAY0_RDDS4 (ERAY0_RDDS_1S4)

/** \brief 614, Read Data Section ${nn} */
#define ERAY0_RDDS_1S5 /*lint --e(923)*/ (*(volatile Ifx_ERAY_RDDS_1S*)0xF001C614u)
/** Alias (User Manual Name) for ERAY0_RDDS_1S5.
* To use register names with standard convension, please use ERAY0_RDDS_1S5.
*/
#define ERAY0_RDDS5 (ERAY0_RDDS_1S5)

/** \brief 618, Read Data Section ${nn} */
#define ERAY0_RDDS_1S6 /*lint --e(923)*/ (*(volatile Ifx_ERAY_RDDS_1S*)0xF001C618u)
/** Alias (User Manual Name) for ERAY0_RDDS_1S6.
* To use register names with standard convension, please use ERAY0_RDDS_1S6.
*/
#define ERAY0_RDDS6 (ERAY0_RDDS_1S6)

/** \brief 61C, Read Data Section ${nn} */
#define ERAY0_RDDS_1S7 /*lint --e(923)*/ (*(volatile Ifx_ERAY_RDDS_1S*)0xF001C61Cu)
/** Alias (User Manual Name) for ERAY0_RDDS_1S7.
* To use register names with standard convension, please use ERAY0_RDDS_1S7.
*/
#define ERAY0_RDDS7 (ERAY0_RDDS_1S7)

/** \brief 620, Read Data Section ${nn} */
#define ERAY0_RDDS_1S8 /*lint --e(923)*/ (*(volatile Ifx_ERAY_RDDS_1S*)0xF001C620u)
/** Alias (User Manual Name) for ERAY0_RDDS_1S8.
* To use register names with standard convension, please use ERAY0_RDDS_1S8.
*/
#define ERAY0_RDDS8 (ERAY0_RDDS_1S8)

/** \brief 624, Read Data Section ${nn} */
#define ERAY0_RDDS_1S9 /*lint --e(923)*/ (*(volatile Ifx_ERAY_RDDS_1S*)0xF001C624u)
/** Alias (User Manual Name) for ERAY0_RDDS_1S9.
* To use register names with standard convension, please use ERAY0_RDDS_1S9.
*/
#define ERAY0_RDDS9 (ERAY0_RDDS_1S9)

/** \brief 628, Read Data Section ${nn} */
#define ERAY0_RDDS_1S10 /*lint --e(923)*/ (*(volatile Ifx_ERAY_RDDS_1S*)0xF001C628u)
/** Alias (User Manual Name) for ERAY0_RDDS_1S10.
* To use register names with standard convension, please use ERAY0_RDDS_1S10.
*/
#define ERAY0_RDDS10 (ERAY0_RDDS_1S10)

/** \brief 62C, Read Data Section ${nn} */
#define ERAY0_RDDS_1S11 /*lint --e(923)*/ (*(volatile Ifx_ERAY_RDDS_1S*)0xF001C62Cu)
/** Alias (User Manual Name) for ERAY0_RDDS_1S11.
* To use register names with standard convension, please use ERAY0_RDDS_1S11.
*/
#define ERAY0_RDDS11 (ERAY0_RDDS_1S11)

/** \brief 630, Read Data Section ${nn} */
#define ERAY0_RDDS_1S12 /*lint --e(923)*/ (*(volatile Ifx_ERAY_RDDS_1S*)0xF001C630u)
/** Alias (User Manual Name) for ERAY0_RDDS_1S12.
* To use register names with standard convension, please use ERAY0_RDDS_1S12.
*/
#define ERAY0_RDDS12 (ERAY0_RDDS_1S12)

/** \brief 634, Read Data Section ${nn} */
#define ERAY0_RDDS_1S13 /*lint --e(923)*/ (*(volatile Ifx_ERAY_RDDS_1S*)0xF001C634u)
/** Alias (User Manual Name) for ERAY0_RDDS_1S13.
* To use register names with standard convension, please use ERAY0_RDDS_1S13.
*/
#define ERAY0_RDDS13 (ERAY0_RDDS_1S13)

/** \brief 638, Read Data Section ${nn} */
#define ERAY0_RDDS_1S14 /*lint --e(923)*/ (*(volatile Ifx_ERAY_RDDS_1S*)0xF001C638u)
/** Alias (User Manual Name) for ERAY0_RDDS_1S14.
* To use register names with standard convension, please use ERAY0_RDDS_1S14.
*/
#define ERAY0_RDDS14 (ERAY0_RDDS_1S14)

/** \brief 63C, Read Data Section ${nn} */
#define ERAY0_RDDS_1S15 /*lint --e(923)*/ (*(volatile Ifx_ERAY_RDDS_1S*)0xF001C63Cu)
/** Alias (User Manual Name) for ERAY0_RDDS_1S15.
* To use register names with standard convension, please use ERAY0_RDDS_1S15.
*/
#define ERAY0_RDDS15 (ERAY0_RDDS_1S15)

/** \brief 640, Read Data Section ${nn} */
#define ERAY0_RDDS_1S16 /*lint --e(923)*/ (*(volatile Ifx_ERAY_RDDS_1S*)0xF001C640u)
/** Alias (User Manual Name) for ERAY0_RDDS_1S16.
* To use register names with standard convension, please use ERAY0_RDDS_1S16.
*/
#define ERAY0_RDDS16 (ERAY0_RDDS_1S16)

/** \brief 644, Read Data Section ${nn} */
#define ERAY0_RDDS_1S17 /*lint --e(923)*/ (*(volatile Ifx_ERAY_RDDS_1S*)0xF001C644u)
/** Alias (User Manual Name) for ERAY0_RDDS_1S17.
* To use register names with standard convension, please use ERAY0_RDDS_1S17.
*/
#define ERAY0_RDDS17 (ERAY0_RDDS_1S17)

/** \brief 648, Read Data Section ${nn} */
#define ERAY0_RDDS_1S18 /*lint --e(923)*/ (*(volatile Ifx_ERAY_RDDS_1S*)0xF001C648u)
/** Alias (User Manual Name) for ERAY0_RDDS_1S18.
* To use register names with standard convension, please use ERAY0_RDDS_1S18.
*/
#define ERAY0_RDDS18 (ERAY0_RDDS_1S18)

