Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxEray_reg.h
/** \brief 64C, Read Data Section ${nn} */
#define ERAY0_RDDS_1S19 /*lint --e(923)*/ (*(volatile Ifx_ERAY_RDDS_1S*)0xF001C64Cu)
/** Alias (User Manual Name) for ERAY0_RDDS_1S19.
* To use register names with standard convension, please use ERAY0_RDDS_1S19.
*/
#define ERAY0_RDDS19 (ERAY0_RDDS_1S19)

/** \brief 650, Read Data Section ${nn} */
#define ERAY0_RDDS_1S20 /*lint --e(923)*/ (*(volatile Ifx_ERAY_RDDS_1S*)0xF001C650u)
/** Alias (User Manual Name) for ERAY0_RDDS_1S20.
* To use register names with standard convension, please use ERAY0_RDDS_1S20.
*/
#define ERAY0_RDDS20 (ERAY0_RDDS_1S20)

/** \brief 654, Read Data Section ${nn} */
#define ERAY0_RDDS_1S21 /*lint --e(923)*/ (*(volatile Ifx_ERAY_RDDS_1S*)0xF001C654u)
/** Alias (User Manual Name) for ERAY0_RDDS_1S21.
* To use register names with standard convension, please use ERAY0_RDDS_1S21.
*/
#define ERAY0_RDDS21 (ERAY0_RDDS_1S21)

/** \brief 658, Read Data Section ${nn} */
#define ERAY0_RDDS_1S22 /*lint --e(923)*/ (*(volatile Ifx_ERAY_RDDS_1S*)0xF001C658u)
/** Alias (User Manual Name) for ERAY0_RDDS_1S22.
* To use register names with standard convension, please use ERAY0_RDDS_1S22.
*/
#define ERAY0_RDDS22 (ERAY0_RDDS_1S22)

/** \brief 65C, Read Data Section ${nn} */
#define ERAY0_RDDS_1S23 /*lint --e(923)*/ (*(volatile Ifx_ERAY_RDDS_1S*)0xF001C65Cu)
/** Alias (User Manual Name) for ERAY0_RDDS_1S23.
* To use register names with standard convension, please use ERAY0_RDDS_1S23.
*/
#define ERAY0_RDDS23 (ERAY0_RDDS_1S23)

/** \brief 660, Read Data Section ${nn} */
#define ERAY0_RDDS_1S24 /*lint --e(923)*/ (*(volatile Ifx_ERAY_RDDS_1S*)0xF001C660u)
/** Alias (User Manual Name) for ERAY0_RDDS_1S24.
* To use register names with standard convension, please use ERAY0_RDDS_1S24.
*/
#define ERAY0_RDDS24 (ERAY0_RDDS_1S24)

/** \brief 664, Read Data Section ${nn} */
#define ERAY0_RDDS_1S25 /*lint --e(923)*/ (*(volatile Ifx_ERAY_RDDS_1S*)0xF001C664u)
/** Alias (User Manual Name) for ERAY0_RDDS_1S25.
* To use register names with standard convension, please use ERAY0_RDDS_1S25.
*/
#define ERAY0_RDDS25 (ERAY0_RDDS_1S25)

/** \brief 668, Read Data Section ${nn} */
#define ERAY0_RDDS_1S26 /*lint --e(923)*/ (*(volatile Ifx_ERAY_RDDS_1S*)0xF001C668u)
/** Alias (User Manual Name) for ERAY0_RDDS_1S26.
* To use register names with standard convension, please use ERAY0_RDDS_1S26.
*/
#define ERAY0_RDDS26 (ERAY0_RDDS_1S26)

/** \brief 66C, Read Data Section ${nn} */
#define ERAY0_RDDS_1S27 /*lint --e(923)*/ (*(volatile Ifx_ERAY_RDDS_1S*)0xF001C66Cu)
/** Alias (User Manual Name) for ERAY0_RDDS_1S27.
* To use register names with standard convension, please use ERAY0_RDDS_1S27.
*/
#define ERAY0_RDDS27 (ERAY0_RDDS_1S27)

/** \brief 670, Read Data Section ${nn} */
#define ERAY0_RDDS_1S28 /*lint --e(923)*/ (*(volatile Ifx_ERAY_RDDS_1S*)0xF001C670u)
/** Alias (User Manual Name) for ERAY0_RDDS_1S28.
* To use register names with standard convension, please use ERAY0_RDDS_1S28.
*/
#define ERAY0_RDDS28 (ERAY0_RDDS_1S28)

/** \brief 674, Read Data Section ${nn} */
#define ERAY0_RDDS_1S29 /*lint --e(923)*/ (*(volatile Ifx_ERAY_RDDS_1S*)0xF001C674u)
/** Alias (User Manual Name) for ERAY0_RDDS_1S29.
* To use register names with standard convension, please use ERAY0_RDDS_1S29.
*/
#define ERAY0_RDDS29 (ERAY0_RDDS_1S29)

/** \brief 678, Read Data Section ${nn} */
#define ERAY0_RDDS_1S30 /*lint --e(923)*/ (*(volatile Ifx_ERAY_RDDS_1S*)0xF001C678u)
/** Alias (User Manual Name) for ERAY0_RDDS_1S30.
* To use register names with standard convension, please use ERAY0_RDDS_1S30.
*/
#define ERAY0_RDDS30 (ERAY0_RDDS_1S30)

/** \brief 67C, Read Data Section ${nn} */
#define ERAY0_RDDS_1S31 /*lint --e(923)*/ (*(volatile Ifx_ERAY_RDDS_1S*)0xF001C67Cu)
/** Alias (User Manual Name) for ERAY0_RDDS_1S31.
* To use register names with standard convension, please use ERAY0_RDDS_1S31.
*/
#define ERAY0_RDDS31 (ERAY0_RDDS_1S31)

/** \brief 680, Read Data Section ${nn} */
#define ERAY0_RDDS_1S32 /*lint --e(923)*/ (*(volatile Ifx_ERAY_RDDS_1S*)0xF001C680u)
/** Alias (User Manual Name) for ERAY0_RDDS_1S32.
* To use register names with standard convension, please use ERAY0_RDDS_1S32.
*/
#define ERAY0_RDDS32 (ERAY0_RDDS_1S32)

/** \brief 684, Read Data Section ${nn} */
#define ERAY0_RDDS_1S33 /*lint --e(923)*/ (*(volatile Ifx_ERAY_RDDS_1S*)0xF001C684u)
/** Alias (User Manual Name) for ERAY0_RDDS_1S33.
* To use register names with standard convension, please use ERAY0_RDDS_1S33.
*/
#define ERAY0_RDDS33 (ERAY0_RDDS_1S33)

/** \brief 688, Read Data Section ${nn} */
#define ERAY0_RDDS_1S34 /*lint --e(923)*/ (*(volatile Ifx_ERAY_RDDS_1S*)0xF001C688u)
/** Alias (User Manual Name) for ERAY0_RDDS_1S34.
* To use register names with standard convension, please use ERAY0_RDDS_1S34.
*/
#define ERAY0_RDDS34 (ERAY0_RDDS_1S34)

/** \brief 68C, Read Data Section ${nn} */
#define ERAY0_RDDS_1S35 /*lint --e(923)*/ (*(volatile Ifx_ERAY_RDDS_1S*)0xF001C68Cu)
/** Alias (User Manual Name) for ERAY0_RDDS_1S35.
* To use register names with standard convension, please use ERAY0_RDDS_1S35.
*/
#define ERAY0_RDDS35 (ERAY0_RDDS_1S35)

/** \brief 690, Read Data Section ${nn} */
#define ERAY0_RDDS_1S36 /*lint --e(923)*/ (*(volatile Ifx_ERAY_RDDS_1S*)0xF001C690u)
/** Alias (User Manual Name) for ERAY0_RDDS_1S36.
* To use register names with standard convension, please use ERAY0_RDDS_1S36.
*/
#define ERAY0_RDDS36 (ERAY0_RDDS_1S36)

/** \brief 694, Read Data Section ${nn} */
#define ERAY0_RDDS_1S37 /*lint --e(923)*/ (*(volatile Ifx_ERAY_RDDS_1S*)0xF001C694u)
/** Alias (User Manual Name) for ERAY0_RDDS_1S37.
* To use register names with standard convension, please use ERAY0_RDDS_1S37.
*/
#define ERAY0_RDDS37 (ERAY0_RDDS_1S37)

/** \brief 698, Read Data Section ${nn} */
#define ERAY0_RDDS_1S38 /*lint --e(923)*/ (*(volatile Ifx_ERAY_RDDS_1S*)0xF001C698u)
/** Alias (User Manual Name) for ERAY0_RDDS_1S38.
* To use register names with standard convension, please use ERAY0_RDDS_1S38.
*/
#define ERAY0_RDDS38 (ERAY0_RDDS_1S38)

/** \brief 69C, Read Data Section ${nn} */
#define ERAY0_RDDS_1S39 /*lint --e(923)*/ (*(volatile Ifx_ERAY_RDDS_1S*)0xF001C69Cu)
/** Alias (User Manual Name) for ERAY0_RDDS_1S39.
* To use register names with standard convension, please use ERAY0_RDDS_1S39.
*/
#define ERAY0_RDDS39 (ERAY0_RDDS_1S39)

/** \brief 6A0, Read Data Section ${nn} */
#define ERAY0_RDDS_1S40 /*lint --e(923)*/ (*(volatile Ifx_ERAY_RDDS_1S*)0xF001C6A0u)
/** Alias (User Manual Name) for ERAY0_RDDS_1S40.
* To use register names with standard convension, please use ERAY0_RDDS_1S40.
*/
#define ERAY0_RDDS40 (ERAY0_RDDS_1S40)

/** \brief 6A4, Read Data Section ${nn} */
#define ERAY0_RDDS_1S41 /*lint --e(923)*/ (*(volatile Ifx_ERAY_RDDS_1S*)0xF001C6A4u)
/** Alias (User Manual Name) for ERAY0_RDDS_1S41.
* To use register names with standard convension, please use ERAY0_RDDS_1S41.
*/
#define ERAY0_RDDS41 (ERAY0_RDDS_1S41)

