Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxEray_reg.h
/** \brief 6A8, Read Data Section ${nn} */
#define ERAY0_RDDS_1S42 /*lint --e(923)*/ (*(volatile Ifx_ERAY_RDDS_1S*)0xF001C6A8u)
/** Alias (User Manual Name) for ERAY0_RDDS_1S42.
* To use register names with standard convension, please use ERAY0_RDDS_1S42.
*/
#define ERAY0_RDDS42 (ERAY0_RDDS_1S42)

/** \brief 6AC, Read Data Section ${nn} */
#define ERAY0_RDDS_1S43 /*lint --e(923)*/ (*(volatile Ifx_ERAY_RDDS_1S*)0xF001C6ACu)
/** Alias (User Manual Name) for ERAY0_RDDS_1S43.
* To use register names with standard convension, please use ERAY0_RDDS_1S43.
*/
#define ERAY0_RDDS43 (ERAY0_RDDS_1S43)

/** \brief 6B0, Read Data Section ${nn} */
#define ERAY0_RDDS_1S44 /*lint --e(923)*/ (*(volatile Ifx_ERAY_RDDS_1S*)0xF001C6B0u)
/** Alias (User Manual Name) for ERAY0_RDDS_1S44.
* To use register names with standard convension, please use ERAY0_RDDS_1S44.
*/
#define ERAY0_RDDS44 (ERAY0_RDDS_1S44)

/** \brief 6B4, Read Data Section ${nn} */
#define ERAY0_RDDS_1S45 /*lint --e(923)*/ (*(volatile Ifx_ERAY_RDDS_1S*)0xF001C6B4u)
/** Alias (User Manual Name) for ERAY0_RDDS_1S45.
* To use register names with standard convension, please use ERAY0_RDDS_1S45.
*/
#define ERAY0_RDDS45 (ERAY0_RDDS_1S45)

/** \brief 6B8, Read Data Section ${nn} */
#define ERAY0_RDDS_1S46 /*lint --e(923)*/ (*(volatile Ifx_ERAY_RDDS_1S*)0xF001C6B8u)
/** Alias (User Manual Name) for ERAY0_RDDS_1S46.
* To use register names with standard convension, please use ERAY0_RDDS_1S46.
*/
#define ERAY0_RDDS46 (ERAY0_RDDS_1S46)

/** \brief 6BC, Read Data Section ${nn} */
#define ERAY0_RDDS_1S47 /*lint --e(923)*/ (*(volatile Ifx_ERAY_RDDS_1S*)0xF001C6BCu)
/** Alias (User Manual Name) for ERAY0_RDDS_1S47.
* To use register names with standard convension, please use ERAY0_RDDS_1S47.
*/
#define ERAY0_RDDS47 (ERAY0_RDDS_1S47)

/** \brief 6C0, Read Data Section ${nn} */
#define ERAY0_RDDS_1S48 /*lint --e(923)*/ (*(volatile Ifx_ERAY_RDDS_1S*)0xF001C6C0u)
/** Alias (User Manual Name) for ERAY0_RDDS_1S48.
* To use register names with standard convension, please use ERAY0_RDDS_1S48.
*/
#define ERAY0_RDDS48 (ERAY0_RDDS_1S48)

/** \brief 6C4, Read Data Section ${nn} */
#define ERAY0_RDDS_1S49 /*lint --e(923)*/ (*(volatile Ifx_ERAY_RDDS_1S*)0xF001C6C4u)
/** Alias (User Manual Name) for ERAY0_RDDS_1S49.
* To use register names with standard convension, please use ERAY0_RDDS_1S49.
*/
#define ERAY0_RDDS49 (ERAY0_RDDS_1S49)

/** \brief 6C8, Read Data Section ${nn} */
#define ERAY0_RDDS_1S50 /*lint --e(923)*/ (*(volatile Ifx_ERAY_RDDS_1S*)0xF001C6C8u)
/** Alias (User Manual Name) for ERAY0_RDDS_1S50.
* To use register names with standard convension, please use ERAY0_RDDS_1S50.
*/
#define ERAY0_RDDS50 (ERAY0_RDDS_1S50)

/** \brief 6CC, Read Data Section ${nn} */
#define ERAY0_RDDS_1S51 /*lint --e(923)*/ (*(volatile Ifx_ERAY_RDDS_1S*)0xF001C6CCu)
/** Alias (User Manual Name) for ERAY0_RDDS_1S51.
* To use register names with standard convension, please use ERAY0_RDDS_1S51.
*/
#define ERAY0_RDDS51 (ERAY0_RDDS_1S51)

/** \brief 6D0, Read Data Section ${nn} */
#define ERAY0_RDDS_1S52 /*lint --e(923)*/ (*(volatile Ifx_ERAY_RDDS_1S*)0xF001C6D0u)
/** Alias (User Manual Name) for ERAY0_RDDS_1S52.
* To use register names with standard convension, please use ERAY0_RDDS_1S52.
*/
#define ERAY0_RDDS52 (ERAY0_RDDS_1S52)

/** \brief 6D4, Read Data Section ${nn} */
#define ERAY0_RDDS_1S53 /*lint --e(923)*/ (*(volatile Ifx_ERAY_RDDS_1S*)0xF001C6D4u)
/** Alias (User Manual Name) for ERAY0_RDDS_1S53.
* To use register names with standard convension, please use ERAY0_RDDS_1S53.
*/
#define ERAY0_RDDS53 (ERAY0_RDDS_1S53)

/** \brief 6D8, Read Data Section ${nn} */
#define ERAY0_RDDS_1S54 /*lint --e(923)*/ (*(volatile Ifx_ERAY_RDDS_1S*)0xF001C6D8u)
/** Alias (User Manual Name) for ERAY0_RDDS_1S54.
* To use register names with standard convension, please use ERAY0_RDDS_1S54.
*/
#define ERAY0_RDDS54 (ERAY0_RDDS_1S54)

/** \brief 6DC, Read Data Section ${nn} */
#define ERAY0_RDDS_1S55 /*lint --e(923)*/ (*(volatile Ifx_ERAY_RDDS_1S*)0xF001C6DCu)
/** Alias (User Manual Name) for ERAY0_RDDS_1S55.
* To use register names with standard convension, please use ERAY0_RDDS_1S55.
*/
#define ERAY0_RDDS55 (ERAY0_RDDS_1S55)

/** \brief 6E0, Read Data Section ${nn} */
#define ERAY0_RDDS_1S56 /*lint --e(923)*/ (*(volatile Ifx_ERAY_RDDS_1S*)0xF001C6E0u)
/** Alias (User Manual Name) for ERAY0_RDDS_1S56.
* To use register names with standard convension, please use ERAY0_RDDS_1S56.
*/
#define ERAY0_RDDS56 (ERAY0_RDDS_1S56)

/** \brief 6E4, Read Data Section ${nn} */
#define ERAY0_RDDS_1S57 /*lint --e(923)*/ (*(volatile Ifx_ERAY_RDDS_1S*)0xF001C6E4u)
/** Alias (User Manual Name) for ERAY0_RDDS_1S57.
* To use register names with standard convension, please use ERAY0_RDDS_1S57.
*/
#define ERAY0_RDDS57 (ERAY0_RDDS_1S57)

/** \brief 6E8, Read Data Section ${nn} */
#define ERAY0_RDDS_1S58 /*lint --e(923)*/ (*(volatile Ifx_ERAY_RDDS_1S*)0xF001C6E8u)
/** Alias (User Manual Name) for ERAY0_RDDS_1S58.
* To use register names with standard convension, please use ERAY0_RDDS_1S58.
*/
#define ERAY0_RDDS58 (ERAY0_RDDS_1S58)

/** \brief 6EC, Read Data Section ${nn} */
#define ERAY0_RDDS_1S59 /*lint --e(923)*/ (*(volatile Ifx_ERAY_RDDS_1S*)0xF001C6ECu)
/** Alias (User Manual Name) for ERAY0_RDDS_1S59.
* To use register names with standard convension, please use ERAY0_RDDS_1S59.
*/
#define ERAY0_RDDS59 (ERAY0_RDDS_1S59)

/** \brief 6F0, Read Data Section ${nn} */
#define ERAY0_RDDS_1S60 /*lint --e(923)*/ (*(volatile Ifx_ERAY_RDDS_1S*)0xF001C6F0u)
/** Alias (User Manual Name) for ERAY0_RDDS_1S60.
* To use register names with standard convension, please use ERAY0_RDDS_1S60.
*/
#define ERAY0_RDDS60 (ERAY0_RDDS_1S60)

/** \brief 6F4, Read Data Section ${nn} */
#define ERAY0_RDDS_1S61 /*lint --e(923)*/ (*(volatile Ifx_ERAY_RDDS_1S*)0xF001C6F4u)
/** Alias (User Manual Name) for ERAY0_RDDS_1S61.
* To use register names with standard convension, please use ERAY0_RDDS_1S61.
*/
#define ERAY0_RDDS61 (ERAY0_RDDS_1S61)

/** \brief 6F8, Read Data Section ${nn} */
#define ERAY0_RDDS_1S62 /*lint --e(923)*/ (*(volatile Ifx_ERAY_RDDS_1S*)0xF001C6F8u)
/** Alias (User Manual Name) for ERAY0_RDDS_1S62.
* To use register names with standard convension, please use ERAY0_RDDS_1S62.
*/
#define ERAY0_RDDS62 (ERAY0_RDDS_1S62)

/** \brief 6FC, Read Data Section ${nn} */
#define ERAY0_RDDS_1S63 /*lint --e(923)*/ (*(volatile Ifx_ERAY_RDDS_1S*)0xF001C6FCu)
/** Alias (User Manual Name) for ERAY0_RDDS_1S63.
* To use register names with standard convension, please use ERAY0_RDDS_1S63.
*/
#define ERAY0_RDDS63 (ERAY0_RDDS_1S63)

/** \brief 700, Read Header Section 1 */
#define ERAY0_RDHS1 /*lint --e(923)*/ (*(volatile Ifx_ERAY_RDHS1*)0xF001C700u)

/** \brief 704, Read Header Section 2 */
#define ERAY0_RDHS2 /*lint --e(923)*/ (*(volatile Ifx_ERAY_RDHS2*)0xF001C704u)

/** \brief 708, Read Header Section 3 */
#define ERAY0_RDHS3 /*lint --e(923)*/ (*(volatile Ifx_ERAY_RDHS3*)0xF001C708u)

/** \brief 70C, Message Buffer Status */
#define ERAY0_MBS /*lint --e(923)*/ (*(volatile Ifx_ERAY_MBS*)0xF001C70Cu)

