Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxEray_reg.h
/** \brief 710, Output Buffer Command Mask */
#define ERAY0_OBCM /*lint --e(923)*/ (*(volatile Ifx_ERAY_OBCM*)0xF001C710u)

/** \brief 714, Output Buffer Command Request */
#define ERAY0_OBCR /*lint --e(923)*/ (*(volatile Ifx_ERAY_OBCR*)0xF001C714u)

/** \brief 870, OCDS Trigger Set Select */
#define ERAY0_OTSS /*lint --e(923)*/ (*(volatile Ifx_ERAY_OTSS*)0xF001C870u)

/** \brief 8E8, OCDS Control and Status */
#define ERAY0_OCS /*lint --e(923)*/ (*(volatile Ifx_ERAY_OCS*)0xF001C8E8u)

/** \brief 8EC, Kernel Reset Status Clear Register */
#define ERAY0_KRSTCLR /*lint --e(923)*/ (*(volatile Ifx_ERAY_KRSTCLR*)0xF001C8ECu)

/** \brief 8F0, Kernel Reset Register 1 */
#define ERAY0_KRST1 /*lint --e(923)*/ (*(volatile Ifx_ERAY_KRST1*)0xF001C8F0u)

/** \brief 8F4, Kernel Reset Register 0 */
#define ERAY0_KRST0 /*lint --e(923)*/ (*(volatile Ifx_ERAY_KRST0*)0xF001C8F4u)

/** \brief 8F8, Access Enable Register 1 */
#define ERAY0_ACCEN1 /*lint --e(923)*/ (*(volatile Ifx_ERAY_ACCEN1*)0xF001C8F8u)

/** \brief 8FC, Access Enable Register 0 */
#define ERAY0_ACCEN0 /*lint --e(923)*/ (*(volatile Ifx_ERAY_ACCEN0*)0xF001C8FCu)

/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Eray_Cfg_Eray1
 * \{  */
/** \brief 0, Clock Control Register */
#define ERAY1_CLC /*lint --e(923)*/ (*(volatile Ifx_ERAY_CLC*)0xF0017000u)

/** \brief 4, Busy and Input Buffer Control Register */
#define ERAY1_CUST1 /*lint --e(923)*/ (*(volatile Ifx_ERAY_CUST1*)0xF0017004u)

/** \brief 8, Module Identification Register */
#define ERAY1_ID /*lint --e(923)*/ (*(volatile Ifx_ERAY_ID*)0xF0017008u)

/** \brief C, Customer Interface Timeout Counter Register */
#define ERAY1_CUST3 /*lint --e(923)*/ (*(volatile Ifx_ERAY_CUST3*)0xF001700Cu)

/** \brief 10, Test Register 1 */
#define ERAY1_TEST1 /*lint --e(923)*/ (*(volatile Ifx_ERAY_TEST1*)0xF0017010u)

/** \brief 14, Test Register 2 */
#define ERAY1_TEST2 /*lint --e(923)*/ (*(volatile Ifx_ERAY_TEST2*)0xF0017014u)

/** \brief 1C, Lock Register */
#define ERAY1_LCK /*lint --e(923)*/ (*(volatile Ifx_ERAY_LCK*)0xF001701Cu)

/** \brief 20, Error Service Request Select Register */
#define ERAY1_EIR /*lint --e(923)*/ (*(volatile Ifx_ERAY_EIR*)0xF0017020u)

/** \brief 24, Status Service Request Register */
#define ERAY1_SIR /*lint --e(923)*/ (*(volatile Ifx_ERAY_SIR*)0xF0017024u)

/** \brief 28, Error Service Request Line Select */
#define ERAY1_EILS /*lint --e(923)*/ (*(volatile Ifx_ERAY_EILS*)0xF0017028u)

/** \brief 2C, Status Service Request Line Select */
#define ERAY1_SILS /*lint --e(923)*/ (*(volatile Ifx_ERAY_SILS*)0xF001702Cu)

/** \brief 30, Error Service Request Enable Set */
#define ERAY1_EIES /*lint --e(923)*/ (*(volatile Ifx_ERAY_EIES*)0xF0017030u)

/** \brief 34, Error Service Request Enable Reset */
#define ERAY1_EIER /*lint --e(923)*/ (*(volatile Ifx_ERAY_EIER*)0xF0017034u)

/** \brief 38, Status Service Request Enable Set */
#define ERAY1_SIES /*lint --e(923)*/ (*(volatile Ifx_ERAY_SIES*)0xF0017038u)

/** \brief 3C, Status Service Request Enable Reset */
#define ERAY1_SIER /*lint --e(923)*/ (*(volatile Ifx_ERAY_SIER*)0xF001703Cu)

/** \brief 40, Service Request Line Enable */
#define ERAY1_ILE /*lint --e(923)*/ (*(volatile Ifx_ERAY_ILE*)0xF0017040u)

/** \brief 44, Timer 0 Configuration */
#define ERAY1_T0C /*lint --e(923)*/ (*(volatile Ifx_ERAY_T0C*)0xF0017044u)

/** \brief 48, Timer 1 Configuration */
#define ERAY1_T1C /*lint --e(923)*/ (*(volatile Ifx_ERAY_T1C*)0xF0017048u)

/** \brief 4C, Stop Watch Register 1 */
#define ERAY1_STPW1 /*lint --e(923)*/ (*(volatile Ifx_ERAY_STPW1*)0xF001704Cu)

/** \brief 50, Stop Watch Register 2 */
#define ERAY1_STPW2 /*lint --e(923)*/ (*(volatile Ifx_ERAY_STPW2*)0xF0017050u)

/** \brief 80, SUC Configuration Register 1 */
#define ERAY1_SUCC1 /*lint --e(923)*/ (*(volatile Ifx_ERAY_SUCC1*)0xF0017080u)

/** \brief 84, SUC Configuration Register 2 */
#define ERAY1_SUCC2 /*lint --e(923)*/ (*(volatile Ifx_ERAY_SUCC2*)0xF0017084u)

/** \brief 88, SUC Configuration Register 3 */
#define ERAY1_SUCC3 /*lint --e(923)*/ (*(volatile Ifx_ERAY_SUCC3*)0xF0017088u)

/** \brief 8C, NEM Configuration Register */
#define ERAY1_NEMC /*lint --e(923)*/ (*(volatile Ifx_ERAY_NEMC*)0xF001708Cu)

/** \brief 90, PRT Configuration Register 1 */
#define ERAY1_PRTC1 /*lint --e(923)*/ (*(volatile Ifx_ERAY_PRTC1*)0xF0017090u)

/** \brief 94, PRT Configuration Register 2 */
#define ERAY1_PRTC2 /*lint --e(923)*/ (*(volatile Ifx_ERAY_PRTC2*)0xF0017094u)

/** \brief 98, MHD Configuration Register */
#define ERAY1_MHDC /*lint --e(923)*/ (*(volatile Ifx_ERAY_MHDC*)0xF0017098u)

/** \brief A0, GTU Configuration Register 1 */
#define ERAY1_GTUC01 /*lint --e(923)*/ (*(volatile Ifx_ERAY_GTUC01*)0xF00170A0u)

/** \brief A4, GTU Configuration Register 2 */
#define ERAY1_GTUC02 /*lint --e(923)*/ (*(volatile Ifx_ERAY_GTUC02*)0xF00170A4u)

/** \brief A8, GTU Configuration Register 3 */
#define ERAY1_GTUC03 /*lint --e(923)*/ (*(volatile Ifx_ERAY_GTUC03*)0xF00170A8u)

/** \brief AC, GTU Configuration Register 4 */
#define ERAY1_GTUC04 /*lint --e(923)*/ (*(volatile Ifx_ERAY_GTUC04*)0xF00170ACu)

/** \brief B0, GTU Configuration Register 5 */
#define ERAY1_GTUC05 /*lint --e(923)*/ (*(volatile Ifx_ERAY_GTUC05*)0xF00170B0u)

/** \brief B4, GTU Configuration Register 6 */
#define ERAY1_GTUC06 /*lint --e(923)*/ (*(volatile Ifx_ERAY_GTUC06*)0xF00170B4u)

/** \brief B8, GTU Configuration Register 7 */
#define ERAY1_GTUC07 /*lint --e(923)*/ (*(volatile Ifx_ERAY_GTUC07*)0xF00170B8u)

/** \brief BC, GTU Configuration Register 8 */
#define ERAY1_GTUC08 /*lint --e(923)*/ (*(volatile Ifx_ERAY_GTUC08*)0xF00170BCu)

/** \brief C0, GTU Configuration Register 9 */
#define ERAY1_GTUC09 /*lint --e(923)*/ (*(volatile Ifx_ERAY_GTUC09*)0xF00170C0u)

/** \brief C4, GTU Configuration Register 10 */
#define ERAY1_GTUC10 /*lint --e(923)*/ (*(volatile Ifx_ERAY_GTUC10*)0xF00170C4u)

/** \brief C8, GTU Configuration Register 11 */
#define ERAY1_GTUC11 /*lint --e(923)*/ (*(volatile Ifx_ERAY_GTUC11*)0xF00170C8u)

