Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxEray_reg.h
/** \brief 6A8, Read Data Section ${nn} */
#define ERAY1_RDDS_1S42 /*lint --e(923)*/ (*(volatile Ifx_ERAY_RDDS_1S*)0xF00176A8u)
/** Alias (User Manual Name) for ERAY1_RDDS_1S42.
* To use register names with standard convension, please use ERAY1_RDDS_1S42.
*/
#define ERAY1_RDDS42 (ERAY1_RDDS_1S42)

/** \brief 6AC, Read Data Section ${nn} */
#define ERAY1_RDDS_1S43 /*lint --e(923)*/ (*(volatile Ifx_ERAY_RDDS_1S*)0xF00176ACu)
/** Alias (User Manual Name) for ERAY1_RDDS_1S43.
* To use register names with standard convension, please use ERAY1_RDDS_1S43.
*/
#define ERAY1_RDDS43 (ERAY1_RDDS_1S43)

/** \brief 6B0, Read Data Section ${nn} */
#define ERAY1_RDDS_1S44 /*lint --e(923)*/ (*(volatile Ifx_ERAY_RDDS_1S*)0xF00176B0u)
/** Alias (User Manual Name) for ERAY1_RDDS_1S44.
* To use register names with standard convension, please use ERAY1_RDDS_1S44.
*/
#define ERAY1_RDDS44 (ERAY1_RDDS_1S44)

/** \brief 6B4, Read Data Section ${nn} */
#define ERAY1_RDDS_1S45 /*lint --e(923)*/ (*(volatile Ifx_ERAY_RDDS_1S*)0xF00176B4u)
/** Alias (User Manual Name) for ERAY1_RDDS_1S45.
* To use register names with standard convension, please use ERAY1_RDDS_1S45.
*/
#define ERAY1_RDDS45 (ERAY1_RDDS_1S45)

/** \brief 6B8, Read Data Section ${nn} */
#define ERAY1_RDDS_1S46 /*lint --e(923)*/ (*(volatile Ifx_ERAY_RDDS_1S*)0xF00176B8u)
/** Alias (User Manual Name) for ERAY1_RDDS_1S46.
* To use register names with standard convension, please use ERAY1_RDDS_1S46.
*/
#define ERAY1_RDDS46 (ERAY1_RDDS_1S46)

/** \brief 6BC, Read Data Section ${nn} */
#define ERAY1_RDDS_1S47 /*lint --e(923)*/ (*(volatile Ifx_ERAY_RDDS_1S*)0xF00176BCu)
/** Alias (User Manual Name) for ERAY1_RDDS_1S47.
* To use register names with standard convension, please use ERAY1_RDDS_1S47.
*/
#define ERAY1_RDDS47 (ERAY1_RDDS_1S47)

/** \brief 6C0, Read Data Section ${nn} */
#define ERAY1_RDDS_1S48 /*lint --e(923)*/ (*(volatile Ifx_ERAY_RDDS_1S*)0xF00176C0u)
/** Alias (User Manual Name) for ERAY1_RDDS_1S48.
* To use register names with standard convension, please use ERAY1_RDDS_1S48.
*/
#define ERAY1_RDDS48 (ERAY1_RDDS_1S48)

/** \brief 6C4, Read Data Section ${nn} */
#define ERAY1_RDDS_1S49 /*lint --e(923)*/ (*(volatile Ifx_ERAY_RDDS_1S*)0xF00176C4u)
/** Alias (User Manual Name) for ERAY1_RDDS_1S49.
* To use register names with standard convension, please use ERAY1_RDDS_1S49.
*/
#define ERAY1_RDDS49 (ERAY1_RDDS_1S49)

/** \brief 6C8, Read Data Section ${nn} */
#define ERAY1_RDDS_1S50 /*lint --e(923)*/ (*(volatile Ifx_ERAY_RDDS_1S*)0xF00176C8u)
/** Alias (User Manual Name) for ERAY1_RDDS_1S50.
* To use register names with standard convension, please use ERAY1_RDDS_1S50.
*/
#define ERAY1_RDDS50 (ERAY1_RDDS_1S50)

/** \brief 6CC, Read Data Section ${nn} */
#define ERAY1_RDDS_1S51 /*lint --e(923)*/ (*(volatile Ifx_ERAY_RDDS_1S*)0xF00176CCu)
/** Alias (User Manual Name) for ERAY1_RDDS_1S51.
* To use register names with standard convension, please use ERAY1_RDDS_1S51.
*/
#define ERAY1_RDDS51 (ERAY1_RDDS_1S51)

/** \brief 6D0, Read Data Section ${nn} */
#define ERAY1_RDDS_1S52 /*lint --e(923)*/ (*(volatile Ifx_ERAY_RDDS_1S*)0xF00176D0u)
/** Alias (User Manual Name) for ERAY1_RDDS_1S52.
* To use register names with standard convension, please use ERAY1_RDDS_1S52.
*/
#define ERAY1_RDDS52 (ERAY1_RDDS_1S52)

/** \brief 6D4, Read Data Section ${nn} */
#define ERAY1_RDDS_1S53 /*lint --e(923)*/ (*(volatile Ifx_ERAY_RDDS_1S*)0xF00176D4u)
/** Alias (User Manual Name) for ERAY1_RDDS_1S53.
* To use register names with standard convension, please use ERAY1_RDDS_1S53.
*/
#define ERAY1_RDDS53 (ERAY1_RDDS_1S53)

/** \brief 6D8, Read Data Section ${nn} */
#define ERAY1_RDDS_1S54 /*lint --e(923)*/ (*(volatile Ifx_ERAY_RDDS_1S*)0xF00176D8u)
/** Alias (User Manual Name) for ERAY1_RDDS_1S54.
* To use register names with standard convension, please use ERAY1_RDDS_1S54.
*/
#define ERAY1_RDDS54 (ERAY1_RDDS_1S54)

/** \brief 6DC, Read Data Section ${nn} */
#define ERAY1_RDDS_1S55 /*lint --e(923)*/ (*(volatile Ifx_ERAY_RDDS_1S*)0xF00176DCu)
/** Alias (User Manual Name) for ERAY1_RDDS_1S55.
* To use register names with standard convension, please use ERAY1_RDDS_1S55.
*/
#define ERAY1_RDDS55 (ERAY1_RDDS_1S55)

/** \brief 6E0, Read Data Section ${nn} */
#define ERAY1_RDDS_1S56 /*lint --e(923)*/ (*(volatile Ifx_ERAY_RDDS_1S*)0xF00176E0u)
/** Alias (User Manual Name) for ERAY1_RDDS_1S56.
* To use register names with standard convension, please use ERAY1_RDDS_1S56.
*/
#define ERAY1_RDDS56 (ERAY1_RDDS_1S56)

/** \brief 6E4, Read Data Section ${nn} */
#define ERAY1_RDDS_1S57 /*lint --e(923)*/ (*(volatile Ifx_ERAY_RDDS_1S*)0xF00176E4u)
/** Alias (User Manual Name) for ERAY1_RDDS_1S57.
* To use register names with standard convension, please use ERAY1_RDDS_1S57.
*/
#define ERAY1_RDDS57 (ERAY1_RDDS_1S57)

/** \brief 6E8, Read Data Section ${nn} */
#define ERAY1_RDDS_1S58 /*lint --e(923)*/ (*(volatile Ifx_ERAY_RDDS_1S*)0xF00176E8u)
/** Alias (User Manual Name) for ERAY1_RDDS_1S58.
* To use register names with standard convension, please use ERAY1_RDDS_1S58.
*/
#define ERAY1_RDDS58 (ERAY1_RDDS_1S58)

/** \brief 6EC, Read Data Section ${nn} */
#define ERAY1_RDDS_1S59 /*lint --e(923)*/ (*(volatile Ifx_ERAY_RDDS_1S*)0xF00176ECu)
/** Alias (User Manual Name) for ERAY1_RDDS_1S59.
* To use register names with standard convension, please use ERAY1_RDDS_1S59.
*/
#define ERAY1_RDDS59 (ERAY1_RDDS_1S59)

/** \brief 6F0, Read Data Section ${nn} */
#define ERAY1_RDDS_1S60 /*lint --e(923)*/ (*(volatile Ifx_ERAY_RDDS_1S*)0xF00176F0u)
/** Alias (User Manual Name) for ERAY1_RDDS_1S60.
* To use register names with standard convension, please use ERAY1_RDDS_1S60.
*/
#define ERAY1_RDDS60 (ERAY1_RDDS_1S60)

/** \brief 6F4, Read Data Section ${nn} */
#define ERAY1_RDDS_1S61 /*lint --e(923)*/ (*(volatile Ifx_ERAY_RDDS_1S*)0xF00176F4u)
/** Alias (User Manual Name) for ERAY1_RDDS_1S61.
* To use register names with standard convension, please use ERAY1_RDDS_1S61.
*/
#define ERAY1_RDDS61 (ERAY1_RDDS_1S61)

/** \brief 6F8, Read Data Section ${nn} */
#define ERAY1_RDDS_1S62 /*lint --e(923)*/ (*(volatile Ifx_ERAY_RDDS_1S*)0xF00176F8u)
/** Alias (User Manual Name) for ERAY1_RDDS_1S62.
* To use register names with standard convension, please use ERAY1_RDDS_1S62.
*/
#define ERAY1_RDDS62 (ERAY1_RDDS_1S62)

/** \brief 6FC, Read Data Section ${nn} */
#define ERAY1_RDDS_1S63 /*lint --e(923)*/ (*(volatile Ifx_ERAY_RDDS_1S*)0xF00176FCu)
/** Alias (User Manual Name) for ERAY1_RDDS_1S63.
* To use register names with standard convension, please use ERAY1_RDDS_1S63.
*/
#define ERAY1_RDDS63 (ERAY1_RDDS_1S63)

/** \brief 700, Read Header Section 1 */
#define ERAY1_RDHS1 /*lint --e(923)*/ (*(volatile Ifx_ERAY_RDHS1*)0xF0017700u)

/** \brief 704, Read Header Section 2 */
#define ERAY1_RDHS2 /*lint --e(923)*/ (*(volatile Ifx_ERAY_RDHS2*)0xF0017704u)

/** \brief 708, Read Header Section 3 */
#define ERAY1_RDHS3 /*lint --e(923)*/ (*(volatile Ifx_ERAY_RDHS3*)0xF0017708u)

/** \brief 70C, Message Buffer Status */
#define ERAY1_MBS /*lint --e(923)*/ (*(volatile Ifx_ERAY_MBS*)0xF001770Cu)

/** \brief 710, Output Buffer Command Mask */
#define ERAY1_OBCM /*lint --e(923)*/ (*(volatile Ifx_ERAY_OBCM*)0xF0017710u)

/** \brief 714, Output Buffer Command Request */
#define ERAY1_OBCR /*lint --e(923)*/ (*(volatile Ifx_ERAY_OBCR*)0xF0017714u)

/** \brief 870, OCDS Trigger Set Select */
#define ERAY1_OTSS /*lint --e(923)*/ (*(volatile Ifx_ERAY_OTSS*)0xF0017870u)

/** \brief 8E8, OCDS Control and Status */
#define ERAY1_OCS /*lint --e(923)*/ (*(volatile Ifx_ERAY_OCS*)0xF00178E8u)

/** \brief 8EC, Kernel Reset Status Clear Register */
#define ERAY1_KRSTCLR /*lint --e(923)*/ (*(volatile Ifx_ERAY_KRSTCLR*)0xF00178ECu)

/** \brief 8F0, Kernel Reset Register 1 */
#define ERAY1_KRST1 /*lint --e(923)*/ (*(volatile Ifx_ERAY_KRST1*)0xF00178F0u)

/** \brief 8F4, Kernel Reset Register 0 */
#define ERAY1_KRST0 /*lint --e(923)*/ (*(volatile Ifx_ERAY_KRST0*)0xF00178F4u)

/** \brief 8F8, Access Enable Register 1 */
#define ERAY1_ACCEN1 /*lint --e(923)*/ (*(volatile Ifx_ERAY_ACCEN1*)0xF00178F8u)

/** \brief 8FC, Access Enable Register 0 */
#define ERAY1_ACCEN0 /*lint --e(923)*/ (*(volatile Ifx_ERAY_ACCEN0*)0xF00178FCu)

/** \}  */
/******************************************************************************/
/******************************************************************************/
#endif /* IFXERAY_REG_H */
